comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_YCSB_performance/RocksDB_10B_val128_mem8MB_zipf1.2_iterator6.log
Set seed to 1732144282910290 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    1000000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    137329.1 MB (estimated)
FileSize:   15258.8 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [/mnt/hotdb_test/rocks10B/ycsba_mem8MB_1.2_ierator_6]
fillzipf     :      22.157 micros/op 45132 ops/sec 22157.158 seconds 1000000000 operations;    6.2 MB/s
Microseconds per write:
Count: 1000000000 Average: 22.1572  StdDev: 1866.22
Min: 2  Median: 3.8198  Max: 2542605
Percentiles: P50: 3.82 P75: 5.52 P99: 14.88 P99.9: 3193.56 P99.99: 14993.13
------------------------------------------------------
(       1,       2 ]   613378   0.061%   0.061% 
(       2,       3 ] 253661397  25.366%  25.427% #####
(       3,       4 ] 299732757  29.973%  55.401% ######
(       4,       6 ] 258657341  25.866%  81.266% #####
(       6,      10 ] 134260907  13.426%  94.693% ###
(      10,      15 ] 44177472   4.418%  99.110% #
(      15,      22 ]  4728038   0.473%  99.583% 
(      22,      34 ]  1196754   0.120%  99.703% 
(      34,      51 ]   272431   0.027%  99.730% 
(      51,      76 ]    45326   0.005%  99.735% 
(      76,     110 ]    27121   0.003%  99.737% 
(     110,     170 ]    52656   0.005%  99.743% 
(     170,     250 ]    78947   0.008%  99.750% 
(     250,     380 ]    87686   0.009%  99.759% 
(     380,     580 ]    88034   0.009%  99.768% 
(     580,     870 ]    90186   0.009%  99.777% 
(     870,    1300 ]   142020   0.014%  99.791% 
(    1300,    1900 ]    99625   0.010%  99.801% 
(    1900,    2900 ]   841077   0.084%  99.885% 
(    2900,    4400 ]   750351   0.075%  99.960% 
(    4400,    6600 ]   214473   0.021%  99.982% 
(    6600,    9900 ]    52750   0.005%  99.987% 
(    9900,   14000 ]    25332   0.003%  99.990% 
(   14000,   22000 ]    31746   0.003%  99.993% 
(   22000,   33000 ]    20065   0.002%  99.995% 
(   33000,   50000 ]     9987   0.001%  99.996% 
(   50000,   75000 ]    16680   0.002%  99.997% 
(   75000,  110000 ]     5364   0.001%  99.998% 
(  110000,  170000 ]     3817   0.000%  99.998% 
(  170000,  250000 ]     3028   0.000%  99.999% 
(  250000,  380000 ]     5039   0.001%  99.999% 
(  380000,  570000 ]     6177   0.001% 100.000% 
(  570000,  860000 ]     1675   0.000% 100.000% 
(  860000, 1200000 ]      274   0.000% 100.000% 
( 1200000, 1900000 ]       80   0.000% 100.000% 
( 1900000, 2900000 ]        9   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      5/4   17.55 MB   0.2    548.2     0.0    548.2     566.0     17.8       0.0  13.1     36.1     37.3  15542.46           4035.32    211427    0.074   4006M   183M       0.0       0.0
  L1    259/0   255.87 MB   1.0    193.6    17.8    175.8     191.5     15.7       0.0  10.8     27.2     26.9   7276.37           1726.22       769    9.462   1406M    14M       0.0       0.0
  L2   2598/0    2.50 GB   1.0     64.5    14.9     49.6      55.4      5.8       0.5   3.7     27.3     23.5   2415.89            574.62     15811    0.153    473M    67M       0.0       0.0
  L3   3943/0    3.78 GB   0.2      0.0     0.0      0.0       0.0      0.0       3.8   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum   6805/4    6.54 GB   0.0    806.3    32.7    773.6     812.8     39.2       4.3  18.9     32.7     33.0  25234.71           6336.16    228007    0.111   5886M   265M       0.0       0.0
 Int      0/0    0.00 KB   0.0     21.7     0.9     20.7      21.8      1.1       0.2  18.6     36.0     36.3    616.00            163.73      6186    0.100    158M  7443K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0    806.3    32.7    773.6     769.8     -3.8       0.0   0.0     50.4     48.2  16369.26           5712.35     53838    0.304   5886M   265M       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      43.0     43.0       0.0   0.0      0.0      5.0   8865.45            623.81    174169    0.051       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 22157.2 total, 554.1 interval
Flush(GB): cumulative 43.048, interval 1.172
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 812.81 GB write, 37.56 MB/s write, 806.27 GB read, 37.26 MB/s read, 25234.7 seconds
Interval compaction: 21.81 GB write, 40.30 MB/s write, 21.66 GB read, 40.03 MB/s read, 616.0 seconds
Estimated pending compaction bytes: 514120386
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 2048, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 2066, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 126655, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 2066, total-stops: 126655
interval: 4060 total count
Block cache LRUCache@0x5d4414743020#1958682 capacity: 8.00 MB seed: 1152302674 usage: 16.71 KB table_size: 256 occupancy: 5 collections: 37 last_copies: 0 last_secs: 6.7e-05 secs_since: 554
Block cache entry stats(count,size,portion): Misc(4,12.25 KB,0.149536%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 22157.2 total, 0.0 interval
Cumulative writes: 1000M writes, 1000M keys, 1000M commit groups, 1.0 writes per commit group, ingest: 149.01 GB, 6.89 MB/s
Cumulative WAL: 1000M writes, 0 syncs, 1000000000.00 writes per sync, written: 149.01 GB, 6.89 MB/s
Cumulative stall: 03:51:14.481 H:M:S, 62.6 percent
Interval writes: 1 writes, 1 keys, 1 commit groups, 1.0 writes per commit group, ingest: 0.00 MB, 0.10 MB/s
Interval WAL: 1 writes, 0 syncs, 1.00 writes per sync, written: 0.00 GB, 0.10 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0