comparedDBs/performance_test_scripts/Rocksdb_scripts/10B_RocksDB_YCSB_performance/RocksDB_10B_val128_mem8MB_zipf1.3_randomA.log
Set seed to 1732857074330402 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     128 bytes each (0 bytes after compression)
Entries:    1000000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    137329.1 MB (estimated)
FileSize:   15258.8 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
DB path: [/mnt/hotdb_test/rocks10B/ycsba_mem8MB_1.3_ierator_1]
ycsba        :      97.191 micros/op 10289 ops/sec 48.595 seconds 500000 operations;    1.4 MB/s
Microseconds per read:
Count: 500000 Average: 97.1908  StdDev: 134.67
Min: 3  Median: 29.2755  Max: 42641
Percentiles: P50: 29.28 P75: 176.67 P99: 491.87 P99.9: 853.01 P99.99: 1591.89
------------------------------------------------------
(       2,       3 ]       12   0.002%   0.002% 
(       3,       4 ]      258   0.052%   0.054% 
(       4,       6 ]     1619   0.324%   0.378% 
(       6,      10 ]   115066  23.013%  23.391% #####
(      10,      15 ]    21187   4.237%  27.628% #
(      15,      22 ]    45043   9.009%  36.637% ##
(      22,      34 ]   110202  22.040%  58.677% ####
(      34,      51 ]     7221   1.444%  60.122% 
(      51,      76 ]      831   0.166%  60.288% 
(      76,     110 ]    19126   3.825%  64.113% #
(     110,     170 ]    48616   9.723%  73.836% ##
(     170,     250 ]    69770  13.954%  87.790% ###
(     250,     380 ]    51459  10.292%  98.082% ##
(     380,     580 ]     8206   1.641%  99.723% 
(     580,     870 ]      939   0.188%  99.911% 
(     870,    1300 ]      359   0.072%  99.983% 
(    1300,    1900 ]       74   0.015%  99.998% 
(    1900,    2900 ]        8   0.002%  99.999% 
(    4400,    6600 ]        1   0.000%  99.999% 
(    6600,    9900 ]        1   0.000% 100.000% 
(   14000,   22000 ]        1   0.000% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 



** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0      1/0    3.69 MB   0.2      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L1    253/0   255.91 MB   1.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
  L2   1642/0    1.40 GB   0.6      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Sum   1896/0    1.66 GB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0
 Int      0/0    0.00 KB   0.0      0.0     0.0      0.0       0.0      0.0       0.0   0.0      0.0      0.0      0.00              0.00         0    0.000       0      0       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 48.7 total, 48.6 interval
Flush(GB): cumulative 0.000, interval 0.000
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Interval compaction: 0.00 GB write, 0.00 MB/s write, 0.00 GB read, 0.00 MB/s read, 0.0 seconds
Estimated pending compaction bytes: 0
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 0, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 0, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 0, total-stops: 0
Block cache LRUCache@0x604d24522320#3394464 capacity: 8.00 MB seed: 979151650 usage: 0.09 KB table_size: 256 occupancy: 1 collections: 1 last_copies: 0 last_secs: 7.3e-05 secs_since: 48
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 48.7 total, 48.6 interval
Cumulative writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 GB, 0.00 MB/s
Cumulative WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Cumulative stall: 00:00:0.000 H:M:S, 0.0 percent
Interval writes: 0 writes, 0 keys, 0 commit groups, 0.0 writes per commit group, ingest: 0.00 MB, 0.00 MB/s
Interval WAL: 0 writes, 0 syncs, 0.00 writes per sync, written: 0.00 GB, 0.00 MB/s
Interval stall: 00:00:0.000 H:M:S, 0.0 percent
Write Stall (count): write-buffer-manager-limit-stops: 0

Disk nvme0n1: Read: 2442420 MB | Write: 74599959 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 20 MB | Write: 0 MB
Disk nvme0n1: Read: 32 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 30 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
Disk nvme0n1: Read: 29 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
Disk nvme0n1: Read: 28 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
Disk nvme0n1: Read: 27 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
Disk nvme0n1: Read: 26 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
Disk nvme0n1: Read: 25 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 24 MB | Write: 0 MB
Disk nvme0n1: Read: 24 MB | Write: 0 MB
Disk nvme0n1: Read: 24 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 23 MB | Write: 0 MB
Disk nvme0n1: Read: 23 MB | Write: 0 MB
Disk nvme0n1: Read: 22 MB | Write: 0 MB
Disk nvme0n1: Read: 22 MB | Write: 0 MB
Disk nvme0n1: Read: 21 MB | Write: 0 MB
Disk nvme0n1: Read: 20 MB | Write: 0 MB
Disk nvme0n1: Read: 18 MB | Write: 0 MB
Disk nvme0n1: Read: 18 MB | Write: 0 MB
Disk nvme0n1: Read: 20 MB | Write: 0 MB
Disk nvme0n1: Read: 18 MB | Write: 0 MB
Disk nvme0n1: Read: 16 MB | Write: 0 MB
Disk nvme0n1: Read: 16 MB | Write: 0 MB
Disk nvme0n1: Read: 16 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB